app/controllers/games_controller.rb

    def index
        games = Game.order(score: :desc)
---
SELECT "games".* FROM "games" ORDER BY "games"."score" DESC

    def create
      # byebug
      game = Game.create(games_params)
---
INSERT INTO "games" ("user_id", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 25], ["score", 10], ["created_at", "2020-09-09 22:32:09.126692"], ["updated_at", "2020-09-09 22:32:09.126692"]]